---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.Vertex
source: html/bf3b7198-34f1-249d-8db0-f00e16ad3a7b.htm
---
# Vertex Properties

Specifies whether the .NET object represents a valid Revit entity.